[
  {
    "id": "about-me",
    "name": "About me",
    "category": "About me",
    "text": "Hello again! Since  you've already got a little intro about me i won't have to write very much about myself on this slide. But to elaborate a bit more; I can say that I'm currently studying Digital Business Development at NTNU in Trondheim, and during my time up here I have found that I like to program. A lot. This, combined with the fact that I like to create things where I can let my imagination become challenged, made me fall into the front-end aspect of programming. For me, a good user interface is the portal to really exploit the full potential of a digital product - and unfortunately, I often see that this goes to waste. That is why I do my best to develop on this and be a contributor where needed."
  },
  {
    "id": "github",
    "name": "GitHub",
    "category": "GitHub"
  },
  {
    "id": "hovl",
    "name": "HØVL",
    "category": "Projects",
    "text": "HØVL (https://hovl.no) is pro tempore the biggest development project I have worked on. As a co-owner of the company, I saw it as my role to ensure that our web solution should not be a limiting element to our service. For me it was important to be able to create a product that combined both modern and stylish design, while not compromising with the user experience. Together with a fellow student at NTNU, we created the entire infrastructure and back-end of the service on our own, and created a REST API that I could use on the front-end. All front-end, both code and design, is 100 percent self-developed. Today, the project is our active solution for handling payments, logged in users and an admin panel that has revolutionized the handling of deliveries on our behalf. The solution we had previously delivered from a third party was simply useless, and being able to acquire an admin panel tailor-made for ourselves was a major driver of the entire project. The admin panel handles deliveries fully automated, and autogenerates an excel sheet that is formatted correctly for shipment, so all we have to do is press one button to handle all of today's deliveries. In addition to reducing delivery handling from 20+ minutes to a few seconds, we also have integrated discount codes, newsletters and full on-page user management from our managing web app."
  },
  {
    "id": "scrollprogressbar",
    "name": "ScrollProgressBar.js",
    "category": "Projects",
    "text": "ScrollProgressBar.js (https://scrollprogressbar.github.io) is a Javascript library that autogenerates an indicator of how far a user has scrolled the web page. Although similar libraries already exist, it was not the 'product' itself that was most important to me in this project. Ever since I started programming I have looked at a Javascript library as black magic and set it as a personal goal to one day create something like this myself. I also set a goal to be able to make the library compatible right down to IE 9 without using a compiler like Babel. The result was successful, and although it is far from my biggest code project, I am probably a little extra proud because of the emotional connection to being able to create a Javascript car library on my own."
  },
  {
    "id": "side",
    "name": "Online Resume",
    "category": "Projects",
    "text": "Thought I could also write a little about since since this has also been a fun project for me. I've gone back to old roots, and created a minimalist project consisting of only one css file, one javascript file, one (empty) html file, and one .json file as the 'database' of these submissions. The reason for this was that I wanted to combine the knowledge I have gained over the past with a development process that uses nothing but myself (no Babel, Scss, Webpack, NodeJS, etc.). The entire website and all animations are created in a single Javascript file, along with CSS Keyframes. It is neither the most optimal for SEO nor for an efficient development process, but for this project it was not very important. I wanted to play around, create something a little different and really just enjoy myself. I did, and I was happy with the end result - which is the most important thing."
  },
  {
    "id": "contact",
    "name": "Contact",
    "category": "Contact",
    "text": "Whether you want to have a little chat or have a desire to discuss job-related projects, then please contact me on: <p>Phone: <a href='tel:004790917570'>90917570</a></p><p>Email: <a href='mailto:mathiaswpicker@gmail.com'>mathiaswpicker@gmail.com</a></p>"
  }
]
